{"en":{"stage1Scene1TextBox25":"Well done! You’ve used the rule and completed the puzzle. You have opened the portal to a new island. One step closer to home.","stage3Scene1TextBox10":"Here's the completed pattern. Let's see if we can work out the rule in the pattern.","stage3Scene1TextBox2":"This is the last place we'll visit before getting the boat home.","stage1Number1":"Number 1","stage3Scene1TextBox11":"When you have figured out the rule. Press the close view button.","stage3Scene1TextBox12":"It appears to increase by a certain number each time.","autoSave":"...Auto Saving Complete","stage2Scene1TextBox11":"Let's use the rule to fill in the missing shapes.","stage3Scene1TextBox3":"There are no given rules here to find. Instead, we will observe a completed pattern and find the rule ourselves.","stage2Scene2RuleItself":"Circle-Pentagon-Triangle-Square","stage3Scene1TextBox1":"We have arrived at the pattern ruins.","stage2Scene1RuleItself2":"Increase by 1 each diagonal row","stage1Number14":"Number 14","closeView":"Close View","stage2Scene1TextBox9":"Oh good, you found the rule. We can look at it with the button on the top left.","stage3Scene1TextBox24":"I'm going to stay here and guide others who wash up on the shore. It’s been amazing meeting you.","stage2Scene2TextBox10":"Let's take a closer look at it.","stage2Scene1TextBox2":"Here we must find some shapes to complete the shape based pattern puzzle ahead. Let's click on it!","stage2Scene2TextBox5":"Maybe we could find a rule in the previous room to help us.","stage2Scene1ShapeGTriangle":"Green Triangle","stage1Scene2TextBox10":"Well done! The numbers double each time, you have completed this pattern puzzle and opened the portal to the Temple of Shapes.","stage1Scene1TextBox22":"To place a numbered sphere, open your inventory, click the numbered sphere you want with the left mouse button, and then click again on the empty slot to place it.","stage1Scene2RuleItself":"Double the previous number","stage2Scene2TextBox13":"Let's look around.","stage3Scene1TextBox8":"We are going to need to collect all 12 numbered spheres.","stage1Scene1TextBox15":"Let’s take a look at the incomplete pattern in front of us. The numbers seem to increase by 2 each time. If we had the space we could continue this pattern indefinitely.","stage2Scene2TextBox1":"It appears we're still in the Temple Of Shapes. Let's have a look around.","stage3Number28":"Number 28","stage1Scene2TextBox7":"Excellent! You found the rule. You can look at it with the button in the top left.","stage1Scene2TextBox8":"That’s all the spheres. Let's try and complete the pattern puzzle.","stage3Number34":"Number 34","stage1Scene2TextBox6":"Let us see if we can find some numbered spheres as well.","stage3Number7":"Number 7","stage3Scene1TextBox20":"Let's put them in the pedestal puzzle by the dock.","stage1Number11":"Number 11","stage2Scene1TextBox10":"That's all the shapes. Let's head back to the pattern puzzle.","stage2Scene1TextBox3":"How interesting. This pattern appears to be a growing pattern. A growing pattern is a pattern that when continued could go on forever.","stage2Scene2TextBox16":"Excellent. The pattern alternated shapes and colors, and increased by 1 each row. A door has been opened to the pattern ruins. Well done!","stage1Scene1TextBox7":"Look ahead. There is a numbered sphere. Go ahead and walk over it to collect it. It will be added to your inventory. ","stage3Scene1TextBox7":"There are no numbers here at all.","stage3Number25":"Number 25","stage3Scene1TextBox18":"Maybe we'll find the final spheres we need to complete the pattern puzzle and escape.","stage1Number6":"Number 6","stage1Scene1TextBox21":"Now it's time to complete the pattern. Have another look at the given rule if you’ve forgotten and then place the numbered spheres.","stage2Scene1TextBox5":"Let's break them open. Press the E key to swing your stick and break the boxes.","stage2Scene2TextBox4":"Maybe that rule we found will help us.","stage2Number3":"Number 3","stage1Scene1TextBox2":"I should have a look around. I can move with the WASD keys or the arrow keys.","stage3Number1":"Number 1","stage2Number8":"Number 8","stage2Scene1TextBox4":"There appear to be some boxes left here, I wonder what's in them.","stage3Number13":"Number 13","stage1Scene1TextBox9":"There should be 5 more of these numbered spheres around the island, let's go find them.","stage1Scene1TextBox24":"It looks like one or more of the spheres are in the wrong place. Have another look at the rule and try again.","stage3Scene1TextBox15":"Let's explore and see if we can find some spheres.","stage2Scene2TextBox12":"It appears to follow a similar pattern to the last temple. It looks like we're gonna need to find 3 different shapes.","stage3Scene1TextBox16":"Excellent. Only 11 more to find.","stage2Scene1TextBox6":"Oh, a shape came out of that purple box. Let's collect it. These shapes are unlimited and can be used as many times as you need.","stage2Scene2ShapeGPentagon":"Pentagon","stage2Scene2TextBox15":"That's incorrect! One or more shapes are in the wrong place. Remove the incorrect shape and try again.","stage3Number4":"Number 4","stage3Scene1TextBox14":"It looks like a path has appeared up those steps.","inventory":"Inventory","stage1Scene2TextBox4":"This pattern is different from the one on the first island.","stage2Scene2ShapeGSquare":"Square","stage2Scene1TextBox8":"Let's also keep an eye out for the given rule.","newGame":"New Game","stage2Scene2ShapeGDiamond":"Diamond","stage2Scene1ShapeBTriangle":"Blue Triangle","stage1Scene2TextBox3":"It looks like there's a pattern puzzle pedestal up ahead. Let's click on it.","stage2Scene2TextBox9":"There’s the pattern puzzle we need to solve to open the exit.","stage1Scene1TextBox3":"There is a wall blocking my way. I can jump over it with the space bar.","stage3Scene1TextBox6":"Let's have a look.","stage3Scene1TextBox17":"Look down there, another path has opened up in front of the temple ruins.","stage2Scene2TextBox7":"Oh that was the wrong platform. Let's look at the rule and try again.","stage3Scene1TextBox5":"This is the dock, this is where the boat will come to pick you up. It looks like there's a pattern pedestal next to it.","stage1Number7":"Number 7","stage2Scene2TextBox6":"Excellent. You found a rule that should help us get out of the temple.","stage2Scene1RuleItself":"Alternate color","stage1Scene1RuleTitle":"Pattern Rule","stage1Scene1TextBox6":"I’m Polly. Welcome to the Pattern Islands. A mystic set of islands that are filled with pattern-based puzzles.","stage1Scene1TextBox12":"A pattern is a sequence or arrangement that repeats in a predictable way. It could be a series of numbers, shapes, or actions that follow a specific order or design.","stage3Scene1TextBox25":"Thank you for all your help.","stage1Scene2TextBox9":"Now we have all the spheres. Let's figure out the rule and put all the spheres in place.","stage1Scene1TextBox4":"Oh, look, a parrot! I wonder if it can talk?","stage3Number22":"Number 22","stage3Scene1TextBox19":"Excellent. That's all 12 numbered spheres. Well done.","stage1Scene1TextBox11":"This pedestal has spheres that have been set up in a pattern. But, what is a pattern?","stage3Scene1TextBox9":"We need to come back when we have analyzed the complete pattern in the temple and worked out the rule.","stage1Scene1TextBox18":"A given rule is a rule that explicitly states or provides a description of how a pattern is generated.","stage1Scene1TextBox13":"Some of the numbered spheres are missing from the puzzle. We need to find the missing spheres and complete the pattern.","stage3Scene1TextBox23":"That's correct. The numbers increase by 3 each time and alternate odd and even. You did a fantastic job. Here comes the ship back to the mainland.","stage1Scene1TextBox5":"Yes, I can!","stage2Scene2TextBox14":"Fantastic. You found all 3 shapes. Let's head back to the puzzle and solve it.","stage3Scene1TextBox13":"Maybe we can count between each number and see if we can spot a pattern. Also the numbers appear to alternate between odd and even!","stage2Number2":"Number 2","stage1Scene1TextBox20":"That's all the spheres collected. Let's head back to the puzzle.","stage2Number10":"Number 10","stage1Scene1TextBox17":"You found the given rule, well done. You can look at it with the button in the top left.","stage1Scene1TextBox10":"Look over there. It's a pattern puzzle pedestal. You can click on it with your left mouse button. Let's go check it out.","stage2Scene2TextBox17":"Let's open the inventory and add our shapes to complete the pattern.","stage2Number31":"Number 31","stage2Scene1TextBox7":"There should be 1 more purple box and 1 more shape to find.","stage1Scene1TextBox1":"Where am I? What is this place?","stage3Scene1TextBox21":"Do you remember the rule from the completed puzzle at the start of the stage? Let's use that rule to place all the numbered spheres in the right order.","stage2Scene2TextBox3":"Some of those platforms look unsteady. If we're gonna make it across we need to know the correct path.","stage1Scene1TextBox23":"You can deselect an item with the escape key. You can remove an incorrect sphere by left clicking the sphere you want to remove.","ruleButton":"Rule","stage1Scene2TextBox2":"If we complete the number pattern puzzle on this island, we can find our way to the Temple Of Shapes.","stage1Number10":"Number 10","stage1Scene2TextBox11":"That doesn't look right. A number has been placed in the wrong slot. Have a look at the given rule and try again.","stage1Scene2TextBox1":"Welcome to Puzzle Island 2.","stage2Scene2TextBox8":"Well don! You made it across.","stage2Scene1TextBox1":"We made it to the Temple of Shapes.","stage3Scene1TextBox4":"The first thing we need to do is examine the completed pattern in the temple ruins up ahead. We should also look for the dock and the unfinished puzzle as well.","stage3Scene1TextBox22":"Something is not right. A numbered sphere is in the wrong place. Remove the wrong sphere by clicking it with the left mouse button and try again.","stage1Scene2TextBox12":"Let's collect the numbered spheres!","stage3Number16":"Number 16","stage3Number31":"Number 31","stage2Scene1TextBox3b":"We're going to need to find 2 different triangles to complete and carry on the pattern sequence. Let's go find them!","stage2Scene1TextBox3a":"It appears to alternate colour and increase by one every diagonal row.","stage1Scene1TextBox8":"You can open the inventory with the button on the top of the screen.","stage1Scene1TextBox19":"It tells you the formula, operation, or process to follow in order to create or continue the sequence.","stage1Scene1TextBox16":"Let's find the spheres and the piece of paper with the rule written on it.","stage1Scene1TextBox14":"Somewhere on the island, there should be a piece of paper with the given rule on it. We’ll need it if we want to solve this puzzle.","stage1Scene2TextBox5":"There is no rule on this island. Let's try and figure out the rule ourselves by observing the half completed pattern.","stage2Scene2TextBox11":"It's another growing pattern with new shapes. It looks like it's alternating shapes, colors, and amount of shapes in each row.","continue":"Continue","stage3Number19":"Number 19","stage3Number10":"Number 10","stage2Scene2TextBox2":"There is no rule in this area of the temple. We'll need to figure out the pattern rule ourselves.","stage2Scene1TextBox13":"Excellent. The pattern alternates color and each diagonal line increases by 1 each time. A door has been opened to the next section of the temple. Well done!","stage2Scene1TextBox12":"Ah, a shape is in the wrong place. Remove a shape by clicking it and try again.","stage1Scene1RuleItself":"Add 2","stage2Number32":"Number 32","resetButton":"Reset Slots"},"es":{"stage1Scene1TextBox25":"¡Bien hecho! Has usado la regla y has completado el acertijo. Has abierto el portal a una nueva isla. Un paso más cerca de casa.","stage3Scene1TextBox10":"Aquí está el patrón completo. Veamos si podemos descifrar la regla del patrón.","stage3Scene1TextBox2":"Este es el último lugar que visitaremos antes de llevar el barco a casa.","stage1Number1":"Número 1","stage3Scene1TextBox11":"Cuando hayas descifrado la regla, pulsa el botón de Cerrar Vista.","stage3Scene1TextBox12":"Parece aumentar en un número determinado cada vez.","autoSave":"...Guardado automático completo","stage2Scene1TextBox11":"Usemos la regla para completar las formas que faltan.","stage3Scene1TextBox3":"No hay reglas que encontrar. En su lugar, observaremos un patrón completo y encontraremos la regla nosotros mismos.","stage2Scene2RuleItself":"Círculo-Pentágono-Triángulo-Cuadrado","stage3Scene1TextBox1":"Hemos llegado a las Ruinas de Patrón.","stage2Scene1RuleItself2":"Aumenta en 1 cada fila diagonal","stage1Number14":"Número 14","closeView":"Cerrar Vista","stage2Scene1TextBox9":"¡Bien! Encontraste la regla. Podemos verla con el botón de arriba a la izquierda.","stage3Scene1TextBox24":"Me quedaré aquí y guiaré a otros que lleguen a la orilla. Ha sido increíble conocerte.","stage2Scene2TextBox10":"Veámoslo más de cerca.","stage2Scene1TextBox2":" Aquí debemos encontrar algunas formas para completar el acertijo de patrones de formas. ¡Hagamos clic!","stage2Scene2TextBox5":"Quizás podríamos encontrar una regla en la habitación anterior que nos ayude.","stage2Scene1ShapeGTriangle":"Triángulo Verde","stage1Scene2TextBox10":"¡Bien hecho! Los números se duplican cada vez; has completado este acertijo de patrones y has abierto el portal al Templo de las Formas.","stage1Scene1TextBox22":"Para colocar una esfera numerada, abre tu inventario, haz clic en la esfera numerada que quieras con el botón izquierdo del ratón y, a continuación, haz clic de nuevo en el espacio vacío para colocarla.","stage1Scene2RuleItself":"Duplica el número anterior","stage2Scene2TextBox13":"Echemos un vistazo.","stage3Scene1TextBox8":"Tendremos que recolectar las 12 esferas numeradas.","stage1Scene1TextBox15":"Veamos el patrón incompleto que tenemos delante. Los números parecen aumentar de 2 en 2 cada vez. Si tuviéramos espacio, podríamos continuar este patrón para siempre.","stage2Scene2TextBox1":"Parece que seguimos en el Templo de las Formas. Echemos un vistazo.","stage3Number28":"Número 28","stage1Scene2TextBox7":"Excelente, encontraste la regla. Puedes verla con el botón de la esquina superior izquierda.","stage1Scene2TextBox8":"Esas son todas las esferas. Intentemos completar el acertijo del patrón.","stage3Number34":"Número 34","stage1Scene2TextBox6":"Veamos si también podemos encontrar algunas esferas numeradas.","stage3Number7":"Número 7","stage3Scene1TextBox20":"Pongámoslas en el pedestal del acertijo junto al muelle.","stage1Number11":"Número 11","stage2Scene1TextBox10":"Esas son todas las formas. Volvamos al acertijo de patrones.","stage2Scene1TextBox3":"¡Qué interesante! Este patrón parece ser un patrón creciente. Un patrón creciente es un patrón que, si continúa, podría durar indefinidamente.","stage2Scene2TextBox16":"Excelente. El patrón alternaba formas y colores, y aumentaba en 1 cada fila. Se ha abierto un portal a las ruinas del patrón. ¡Bien hecho!","stage1Scene1TextBox7":"Mira hacia adelante. Hay una esfera numerada. Camina sobre ella para recogerla. Se añadirá a tu inventario.","stage3Scene1TextBox7":"No hay ningún número aquí.","stage3Number25":"Número 25","stage3Scene1TextBox18":"Quizás encontremos las esferas finales que necesitamos para completar el acertijo del patrón y escapar.","stage1Number6":"Número 6","stage1Scene1TextBox21":"Ahora es el momento de completar el patrón. Si la has olvidado, revisa la regla dada y luego coloca las esferas numeradas.","stage2Scene1TextBox5":"Vamos a abrirlas. Presiona la tecla E para usar tu palo y romper las cajas.","stage2Scene2TextBox4":"Quizás esa regla que encontramos nos ayude.","stage2Number3":"Número 3","stage1Scene1TextBox2":"Debería echar un vistazo. Puedo moverme con las teclas WASD o las flechas del teclado.","stage3Number1":"Número 1","stage2Number8":"Número 8","stage2Scene1TextBox4":"Parece que quedan algunas cajas aquí, me pregunto qué habrá dentro.","stage3Number13":"Número 13","stage1Scene1TextBox9":"Debería haber 5 esferas numeradas más por la isla, ¡vamos a buscarlas!","stage1Scene1TextBox24":"Parece que una o más esferas están en el lugar equivocado. Revisa la regla e inténtalo de nuevo.","stage3Scene1TextBox15":"Exploremos a ver si encontramos algunas esferas.","stage2Scene2TextBox12":"Parece seguir un patrón similar al del templo anterior. Parece que vamos a tener que encontrar 3 formas diferentes.","stage3Scene1TextBox16":"Excelente. Solo faltan 11.","stage2Scene1TextBox6":"¡Oh, salió una forma de esa caja morada! ¡Ve por ella! Estas formas son ilimitadas y se pueden usar tantas veces como necesites.","stage2Scene2ShapeGPentagon":"Pentágono","stage2Scene2TextBox15":"¡Incorrecto! Una o más formas están en el lugar equivocado. Retira la forma incorrecta e inténtalo de nuevo.","stage3Number4":"Número 1","stage3Scene1TextBox14":"Parece que ha aparecido un camino subiendo por esos escalones.","inventory":"Inventario","stage1Scene2TextBox4":"Este patrón es diferente al de la primera isla.","stage2Scene2ShapeGSquare":"Cuadrado","stage2Scene1TextBox8":"También estemos atentos a la regla dada.","newGame":"Nuevo Juego","stage2Scene2ShapeGDiamond":"Diamante","stage2Scene1ShapeBTriangle":"Triángulo Azul","stage1Scene2TextBox3":"Parece que hay un pedestal con un acertijo de patrones más adelante. Hagamos clic en él.","stage2Scene2TextBox9":"Ahí está el acertijo de patrón que debemos resolver para abrir la salida.","stage1Scene1TextBox3":"Hay un muro que me bloquea el paso. Puedo saltarlo con la barra espaciadora.","stage3Scene1TextBox6":"Echemos un vistazo.","stage3Scene1TextBox17":"Mira abajo, se ha abierto otro camino frente a las ruinas del templo.","stage2Scene2TextBox7":"Ah, esa era la plataforma equivocada. Veamos la regla e intentémoslo de nuevo.","stage3Scene1TextBox5":"Este es el muelle, aquí es donde vendrá el barco a recogerte. Parece que hay un pedestal con un patrón al lado.","stage1Number7":"Número 7","stage2Scene2TextBox6":"Excelente. Encontraste una regla que debería ayudarnos a salir del templo.","stage2Scene1RuleItself":"Alterna color","stage1Scene1RuleTitle":"Regla","stage1Scene1TextBox6":"Soy Polly. Bienvenido a las Islas de los Patrones. Un conjunto místico de islas llenas de acertijos de patrones.","stage1Scene1TextBox12":"Un patrón es una secuencia o arreglo que se repite de forma predecible. Puede ser una serie de números, formas o acciones que siguen un orden específico.","stage3Scene1TextBox25":"Gracias por toda tu ayuda.","stage1Scene2TextBox9":"Ahora tenemos todas las esferas. Descifremos la regla y coloquemos todas las esferas en su lugar.","stage1Scene1TextBox4":"¡Oh, mira, un loro! Me pregunto si puede hablar.","stage3Number22":"Número 22","stage3Scene1TextBox19":"Excelente. Ya son las 12 esferas numeradas. Bien hecho.","stage1Scene1TextBox11":"Este pedestal tiene esferas dispuestas siguiendo un patrón. Pero, ¿qué es un patrón?","stage3Scene1TextBox9":"Necesitamos regresar cuando hayamos analizado el patrón completo en el templo y descubierto la regla.","stage1Scene1TextBox18":"Una regla dada es una regla que explica o describe explícitamente cómo se genera un patrón.","stage1Scene1TextBox13":"Algunas esferas numeradas faltan en el acertijo. Necesitamos encontrarlas y completar el patrón.","stage3Scene1TextBox23":"Correcto. Los números aumentan de 3 en 3 y alternan pares e impares. Hiciste un trabajo fantástico. Aquí viene el barco de vuelta a tierra firme.","stage1Scene1TextBox5":"¡Sí, puedo!","stage2Scene2TextBox14":"Fantástico. Encontraste las 3 formas. Volvamos al acertijo y resolvámoslo.","stage3Scene1TextBox13":"Quizás podamos contar entre cada número y ver si detectamos un patrón. ¡También los números parecen alternar entre pares e impares!","stage2Number2":"Número 2","stage1Scene1TextBox20":"Ya tienes todas las esferas. Volvamos al acertijo.","stage2Number10":"Número 10","stage1Scene1TextBox17":"Encontraste la regla dada, ¡bien hecho! Puedes consultarla con el botón de la esquina superior izquierda.","stage1Scene1TextBox10":"Mira eso. Es un pedestal con un acertijo de patrones. Puedes hacer clic en él con el botón izquierdo del ratón. Vamos a echarle un vistazo.","stage2Scene2TextBox17":"Abramos el inventario y añadamos nuestras formas para completar el patrón.","stage2Number31":"Número 31","stage2Scene1TextBox7":"Debería haber una caja morada más y una forma más por encontrar. ","stage1Scene1TextBox1":"¿Dónde estoy? ¿Qué es este lugar?","stage3Scene1TextBox21":"¿Recuerdas la regla del acertijo completado al principio del nivel? Usemos esa regla para colocar todas las esferas numeradas en el orden correcto.","stage2Scene2TextBox3":"Algunas de esas plataformas parecen inestables. Si queremos cruzar, necesitamos saber el camino correcto.","stage1Scene1TextBox23":"Puedes deseleccionar un elemento con la tecla Esc. Puedes eliminar una esfera incorrecta haciendo clic izquierdo en la esfera que quieres eliminar.","ruleButton":"Regla","stage1Scene2TextBox2":"Si completamos el acertijo del patrón numérico en esta isla, podremos llegar al Templo de las Formas.","stage1Number10":"Número 10","stage1Scene2TextBox11":"Eso no parece correcto. Se ha colocado un número en el lugar equivocado. Revisa la regla dada e inténtalo de nuevo.","stage1Scene2TextBox1":"Bienvenido a la Isla de Acertijos 2.","stage2Scene2TextBox8":"¡Bien hecho, lo lograste!","stage2Scene1TextBox1":"Llegamos al Templo de las Formas.","stage3Scene1TextBox4":"Lo primero que debemos hacer es examinar el patrón completo en las ruinas del templo que están más adelante. También debemos buscar el muelle y el acertijo sin terminar.","stage3Scene1TextBox22":"Algo no está bien. Una esfera numerada está en el lugar equivocado. Retira la esfera haciendo clic con el botón izquierdo del ratón e inténtalo de nuevo.","stage1Scene2TextBox12":"¡Coleccionemos las esferas numeradas!","stage3Number16":"Número 16","stage3Number31":"Número 31","stage2Scene1TextBox3b":"Vamos a necesitar encontrar dos triángulos diferentes para completar y continuar la secuencia del patrón. ¡Vamos a buscarlos!","stage2Scene1TextBox3a":"Parece alternar de color y aumentar en uno en cada fila diagonal.","stage1Scene1TextBox8":"Puedes abrir el inventario con el botón en la parte superior de la pantalla.","stage1Scene1TextBox19":"Te indica la fórmula, la operación o el proceso a seguir para crear o continuar la secuencia.","stage1Scene1TextBox16":"Encontremos las esferas y el trozo de papel con la regla escrita.","stage1Scene1TextBox14":"En algún lugar de la isla, debería haber un trozo de papel con la regla dada. Lo necesitaremos si queremos resolver este acertijo.","stage1Scene2TextBox5":"No hay ninguna regla en esta isla. Intentemos averiguar la regla observando el patrón a medio completar.","stage2Scene2TextBox11":"Es otro patrón creciente con nuevas formas. Parece que alterna formas, colores y cantidad de formas en cada fila.","continue":"Continuar","stage3Number19":"Número 19","stage3Number10":"Número 10","stage2Scene2TextBox2":"No hay ninguna regla en esta zona del templo. Tendremos que averiguar la regla del patrón nosotros mismos.","stage2Scene1TextBox13":"Excelente. El patrón alterna el color y cada línea diagonal aumenta en 1 cada vez. Se ha abierto el portal a la siguiente sección del templo. ¡Bien hecho!","stage2Scene1TextBox12":"Ah, una forma está en el lugar equivocado. Elimina una forma haciendo clic en ella e inténtalo de nuevo.","stage1Scene1RuleItself":"Suma 2","stage2Number32":"Número 32","resetButton":"Reiniciar ranuras"}}